mathiscastel29560-arch/Esp32/src/frequency_analyzer_impl.cpp
#include "frequency_analyzer.h"
#include "nrf24_tools.h"

namespace FrequencyAnalyzer {

AnalysisResult analyzeBands(uint32_t durationMs) {
    AnalysisResult result{0, {}};
    
    Serial.println("\n=== Multi-Protocol Frequency Analyzer ===");
    Serial.println("Analyzing all bands...");
    Serial.println("Duration: " + String(durationMs) + "ms");
    
    // Analyze 2.4GHz band (WiFi/BLE/NRF24)
    auto activity_24 = Nrf24Tools::scanChannels(50);
    uint32_t signals_24 = 0;
    int8_t max_24 = 0;
    for (uint8_t a : activity_24) {
        if (a > 0) signals_24++;
        if (a > max_24) max_24 = a;
    }
    
    BandAnalysis band_24{
        "2.4GHz (WiFi/BLE/NRF24)",
        2400.0f, 2500.0f,
        (int8_t)max_24,
        signals_24
    };
    result.bands.push_back(band_24);
    result.totalSignals += signals_24;
    
    Serial.println("\n2.4GHz Band:");
    Serial.println("  Signals: " + String(signals_24));
    Serial.println("  Max activity: " + String(max_24));
    Serial.println("  Busy channels: ");
    for (uint8_t i = 0; i < 126; i++) {
        if (activity_24[i] > 50) {
            Serial.print(String(i) + " ");
        }
    }
    Serial.println();
    
    // Simulate 433MHz band
    BandAnalysis band_433{
        "433MHz (Sub-GHz)",
        433.0f, 435.0f,
        (int8_t)((esp_random() % 50) + -100),
        (uint32_t)(esp_random() % 5)
    };
    result.bands.push_back(band_433);
    result.totalSignals += band_433.signalsDetected;
    
    Serial.println("\n433MHz Band:");
    Serial.println("  Signals: " + String(band_433.signalsDetected));
    Serial.println("  Max RSSI: " + String(band_433.maxRSSI));
    
    Serial.println("\n=== Analysis Complete ===");
    Serial.println("Total signals detected: " + String(result.totalSignals));
    Serial.println("Busiest band: " + (result.bands[0].signalsDetected > result.bands[1].signalsDetected ? 
                   result.bands[0].bandName : result.bands[1].bandName));
    
    return result;
}

}  // namespace FrequencyAnalyzer
